Revit 2024 API
TableCellStyle.FontName Property
 The font used for this style
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public string FontName { get; set; }
Visual Basic
Public Property FontName As String
	Get
	Set
Visual C++
public:
property String^ FontName {
	String^ get ();
	void set (String^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
TableCellStyle Class
Autodesk.Revit.DB Namespace